"""
Различные слагаемые

По данному числу 1≤n≤10^9 найдите максимальное число k,
для которого n можно представить как сумму k различных натуральных слагаемых.

Выведите в первой строке число k, во второй — k слагаемых.
"""


def addends(n):
    addends = []

    return addends


def main():

    n = input().split()

    result = addends(n)
    print(result)


if __name__ == "__main__":
    main()
